app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-09-02 18:38:41.401303"], ["updated_at", "2019-09-02 18:38:41.401303"]]
---
  def create
    @student = Student.new(student_params(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-09-02 18:38:42.098050"], ["id", 1]]
---
  def update
      @student = Student.find(params[:id])
      @student.update(student_params(:first_name, :last_name))